# -*- coding: utf-8 -*-
song_dict = {306877: '遗失的心跳', 307472: '爱的主打歌', 307679: '突然想起你', 307198: '最熟悉的陌生人', 26127551: '爱不离手', 306894: '潇洒小姐', 26127546: '错的人', 307081: '表白', 307201: '一个人的精彩', 26127547: '闪闪惹人爱', 307057: '类似爱情', 307481: '他和她的故事', 306973: '钻石糖', 307677: 'Cappuccino', 307237: '你是我心中一句惊叹', 307684: '最熟悉的陌生人', 307475: 'U Make Me Wanna', 26127544: '放爱情一个假', 307478: '吻', 307030: '冲动', 307103: '后来的我们', 307084: '然后', 26127565: '遗失的心跳', 307658: '窗外的天气', 26127550: '倒数', 307093: 'L.O.V.E', 306850: '逞强', 28912180: '敢伤', 2095099356: '爱没有错', 307327: '进行式', 307664: '蔷薇', 306920: '错的人', 307087: 'Honey Honey Honey', 307603: '明天', 307626: '下一次恋爱', 307109: '我要的世界', 307251: '地下铁', 26212845: '因为你', 306847: '爱不离手', 307495: '想念圣诞节', 307346: '不配', 26212839: '我喜欢你快乐', 26127556: '类似爱情', 307247: '爱情通关密语', 307195: 'Cappuccino', 307266: '幸福的地图', 307105: '熄灯', 307655: '一个人的精彩', 307253: '来自第五大道的明信片', 28953255: '浪漫来袭', 307101: '代言人', 501347069: '吻', 307622: '我爱你那么多', 307675: '没有人', 307652: '雨季中', 1468114208: '突然想起你', 307683: '爱是个坏东西', 307619: '长话短说', 307221: '爱的主打歌', 307685: '甩啦甩啦？', 307263: '相对无言', 5232561: '一个人的精彩', 419827628: '突然想起你', 307688: '多爱自己一下', 307118: '爱的主打歌', 101344: '最佳听众', 306861: '回不去了吗?', 26127541: 'Super Girl 爱无畏', 544151114: '蔷薇', 307249: '节奏与布鲁士', 307337: '爱上爱', 26127555: '潇洒小姐', 454828913: '窗外的天气', 25648043: '遗失的心跳', 406347889: '最熟悉的陌生人', 543798387: '爱的主打歌', 25648051: '最佳听众', 25648052: '错的人', 25648057: '类似爱情', 26212838: '问自己', 1332717866: '最熟悉的陌生人', 4876534: '幸福的地图', 28977741: '窒爱', 28977742: '记得要微笑', 25648033: '放爱情一个假', 307607: '秘密', 26212846: '插曲', 307663: '夜', 306961: '倒数', 306945: '潇洒小姐(REMIX)', 26212843: '我们的寂寞', 28850299: '不解释亲吻', 306844: '我爱我', 307328: '开始爱', 306898: '狂想．曲', 307614: '天使暂时离开', 307177: 'Elva Is Back', 306969: '不爱．请闪开', 307631: '答应我', 307662: '上钩了', 307334: '一辈子做你的女孩', 28798817: '天雷地火', 307048: '之后', 306959: '闪闪惹人爱', 28798816: '劫后余生', 110370: '败给你', 26212844: '笑着爱你', 307255: '失去你', 26127540: '有爱到就好', 27907066: 'I Believe', 26127548: '冲动', 307164: '他和她的故事', 5232550: '最熟悉的陌生人', 306989: 'WOW', 406737286: '错的人', 306981: '我们多久没牵手', 28977739: '留爱查看', 307490: '转眼之间', 306963: '我陪你哭', 307096: 'Free', 26212840: '快歌', 307681: 'Born To Choose', 307484: '开始飞吧', 307610: 'Let It Go', 493285758: '明天的秘密', 306867: '爱情的微光', 307231: '进行式', 5232572: '我爱你那么多', 26127573: '钻石糖', 307219: '美丽的插曲', 307493: '把心放进来', 307497: '离境', 26127568: '我陪你哭', 307040: '时光隧道', 307487: '穿越时空遇见你', 307349: '魔术', 26212847: 'And I Know (Re-mix Version)', 307107: 'You & Me', 557540047: '舞舞舞', 306870: '余温', 307331: '爱情专用', 306977: '坦白', 307033: '两个人的寂寞', 307265: '你是我心中一句惊叹', 5261905: '最熟悉的陌生人', 307670: '回忆信笺', 28977743: '爱面前谁都十七岁', 306965: '同步呼吸', 307499: '未来', 307261: '静静的看你', 406347772: '我们的爱', 5268423: '手牵手', 1994097568: '最熟悉的陌生人（Cover：萧亚轩）', 1320666836: '错的人（咚鼓版）（翻自 萧亚轩）', 5265907: '进行式', 287330: 'And I Know', 5237045: '让每天都是圣诞节', 307044: '速配程度', 26127549: 'WOW!', 2613840444: '萧亚轩-遗失的心跳（咩咩&DJ阿衡）（DJ阿衡 remix）', 1877526067: '萧亚轩-萧亚轩-爱的主打歌 (OneK Bootleg)（OneK remix）', 1970517110: '萧亚轩-人讲的话就像刀刃（为她苦练刀妹 remix）', 307149: 'And I Know (Remix Version)', 93255: '进行式', 406347890: '进行式', 1341233501: '萧亚轩-错的人（抖音咚鼓版）（秦Sir remix）', 4876356: '进行式', 2065228249: '萧亚轩 - 最熟悉的陌生人-（DJ光仔 remix）', 22854119: '败给你', 1888812021: '败给你', 5257062: '进行式', 27907065: 'Better City Better Life', 25648041: '速配程度 (feat. 倪子冈)', 1963211079: '萧亚轩-表白（Kouromi DoxMain潇潇 Bootleg)', 307071: '我们的爱', 5267260: '进行式', 1989970253: '萧亚轩 - 遗失的心跳(ProgHouse Mix国语女)', 307130: 'Let It Go', 1854189213: '萧亚轩-表白 Bootleg（Richard RC / Paul Cicada remix）', 287234: 'And I Know', 2601703510: '萧亚轩-遗失的心跳（DJ她说 remix）', 406346417: '进行式', 1888677918: '萧亚轩-爱的主打歌（Skone remix）', 2068500348: '萧亚轩-最熟悉的陌生人-DJ版', 1431208885: '萧亚轩-一个人的精彩（郑若曲 remix）', 1840555135: '萧亚轩-蕭亞軒 愛的主打歌 - Alw6il9n艾瑋倫.MIX（Alw6il9n艾瑋倫 remix）', 92989: 'Let It Go', 307541: 'Gotta Let It Go', 1911479478: '萧亚轩-萧亚轩 - 突然想起你(Davis.xRemix)-（Davis.x remix）', 1368037595: '萧亚轩-错的人（秦哲宇 remix）', 1848835844: '萧亚轩-Cappuccino(DJCJ FUNKY MIX)（CJ remix）', 1939629466: '萧亚轩-突然想起你', 1501745041: '萧亚轩-最熟悉的陌生人Rap(Remix 萧亚轩)（$N闰土 remix）', 5250066: '败给你', 1469990285: '萧亚轩-///愛の豚がしゃっくりをする? < H o q u e t d e c o c h o n>///（眠 remix）', 1472573715: '萧亚轩-爱的主打歌（十三少海 remix）', 1351758430: '萧亚轩-突然想起你Remix（杨宇辉 remix）', 1990002536: '萧亚轩-遗失的心跳《dj》（小德 remix）', 25642892: 'WOW!(Live)', 1914456855: '萧亚轩-类似爱情DJ版', 2022656483: '萧亚轩-萧亚轩-闪闪惹人爱', 1806578541: '萧亚轩-错的人 (dj彬仔版)（KS彬仔 remix）', 437250632: '萧亚轩 - carry me+不解释亲吻 立体声混音（2016.10.14）潇洒音乐轩之爱 320（萧亚轩 / 绝 / 潇洒音乐轩之爱 remix）', 1848832180: '萧亚轩-突然想起你 (DJCJ FUNKY MIX) （CJ remix）', 1910647571: '萧亚轩-最熟悉的陌生人（yannleo remix）', 1429296961: '萧亚轩-潇洒小姐【男生版】（王多多 remix）', 541246791: '萧亚轩-冲动（雷雨时 remix）', 1341216916: '萧亚轩-突然想起你（9锐 Remix）', 1867754083: '萧亚轩-萧亚轩-表白（OneK Bootleg）（OneK remix）', 1979457540: '萧亚轩-萧亚轩-最熟悉的陌生人-电子旋律.wav（爱骐Muisc remix）', 1987036115: '萧亚轩-遗失的心跳（原声旺 remix）', 1945781873: '萧亚轩-潇洒小姐（DJ A•J remix）', 1993564471: '萧亚轩 / 罗百吉-Friday night 的卡布奇诺（Austin remix）', 2135007729: '萧亚轩-遗失的心跳（DJ阿团 remix）', 2070751105: '萧亚轩-突然想起你（t6lue=???? remix）', 1984462165: '萧亚轩-遗失的心跳FK（赵诚康 remix）', 2039495091: '萧亚轩-最熟悉的陌生人（吉他版）（红豆 remix）', 1984357005: '萧亚轩 - 遗失的心跳(DJ-Xuan FunkyHouse remix 2022)', 2013420659: '萧亚轩-萧亚轩 - 遗失的心跳(Dj小玉 ProgHouse Mix国语女)（DJ remix）', 1948520689: '萧亚轩-爱的主打歌150house（DJ-MEKI remix）', 1976932414: '萧亚轩-爱的主打歌（SanTu潘垚燃 remix）', 2609144018: '萧亚轩-爱的主打歌(Mashup)（KeepReal remix）', 2006139869: '萧亚轩-倒数（牛转乾坤 remix）', 1973904948: '萧亚轩-表白2K22（DjSense吗啡 remix）', 1862184632: '萧亚轩-表白（Ballrockin / 術 remix）', 1814747976: '萧亚轩-一个人的夜(突然想起你)（雨夜屠夫 / gun-z remix）', 1447416668: '萧亚轩-一 個 人 的 夜 ✦（LuckyMenace remix）', 2005594251: '萧亚轩-表白（ReCircleofficial remix）', 2056724907: '萧亚轩-遗失的心跳（小张同学 remix）', 1818554174: '萧亚轩-突然想起你(糖心蛋rmix)(cove:萧亚轩)（糖心蛋 remix）', 2617683041: '萧亚轩 - 遗失的心跳 (河池DJ小廖 Lak House Mix 2024)', 2619427829: '萧亚轩 - 遗失的心跳 (河池DJ小廖 Lak House Mix 2024)', 1945617047: '萧亚轩-错的人（难返 remix）', 2002123253: '萧亚轩-窗外的天气1_(new)（喜洋洋 remix）', 2000396790: '萧亚轩-类似爱情1_(new)（欧阳晨 remix）', 2606562811: '萧亚轩-错的人（叶斌君 remix）', 2609853286: '萧亚轩-错的人（羊羊羊 remix）', 2137792056: '遗失的心跳', 473964242: '最熟悉的陌生人(Live)', 26082855: 'WOW', 26127545: '最佳听众', 2160574502: '遗失的心跳 (Kiiiu变速版)', 406347963: 'WOW', 307306: '爱我久一点+记得+简单爱+亲爱的你怎么不在我身边(Live)', 22854105: 'WOW', 2158335328: '爱的主打歌 (DJ版)', 2136545276: '遗失的心跳 (3D环绕版) (Single Version)', 498985269: '萧亚轩 - 类似爱情', 2159488074: '遗失的心跳 (DJ版)', 2154142585: '最熟悉的陌生人 (3D环绕版)', 2159891418: '突然想起你 (DJ版)', 2158561074: '倒数 (2009音乐万万岁现场)', 2159886802: '突然想起你 (剧场版)', 2160914963: '最熟悉的陌生人', 2160945085: '爱已决堤', 2155516328: 'More More More (Single Version)', 2160809563: '我爱你那么多', 2165651816: '最熟悉的陌生人', 2153972795: '我还记得你', 2165659395: '突然想起你 (DJ版)', 2160210365: '表白', 2155540227: '闪闪惹人爱 (CCTV-15音乐频道精彩音乐汇现场)', 2160845032: '一个人的精彩 (DJ版)', 2154165265: '突然想起你 (DJ版)', 2153765195: 'U Make Me Wanna (Live)', 2162787716: '遗失的心跳 (大排男版)', 2153971549: '突然想起你 (DJ版)', 2156182762: '遗失的心跳 (DJ版)', 2165152085: '类似爱情 (升调版)', 2156652251: '类似爱情 (DJ虫子版)', 2157670406: 'I Believe (现场伴奏)', 2160115914: '来自第五大道的明信片 (网友改编)', 2158933241: 'U Make Me Wanna', 2165283541: '吻_2012 (10,29_12,20,38)', 2159541086: '萧亚轩-不知道 (派小星 remix)', 2164732267: '萧亚轩-冲动 (Muz Remix)', 2159814151: '萧亚轩-表白 Bootleg (Richard RC / Paul Cicada remix)', 2163280926: '萧亚轩《最熟悉的陌生人》现场版，转眼这首歌都快20年了，时间过得真快！', 2159680480: '萧亚轩'}
def sort_dict_val(song_dict:dict):
    swapped_dict = {v: k for k, v in song_dict.items()}
    print(swapped_dict)
    # 转换为列表，以便排序
    items = list(swapped_dict.items())

    # 根据值进行排序
    items.sort(key=lambda x: x[0])

    # 将排序后的列表转换回字典
    sorted_dict = dict(items)
    return sorted_dict

def handle_duplicate(song_dict:dict):
    songs = sort_dict_val(song_dict)
    print(songs)
    new_song_names = []
    new_songs = {}
    keys = list(songs.keys())
    new_keys = list(songs.keys())
    index = 0
    for key in keys:
        myindex = 0
        compare_song_name = keys[index]
        if compare_song_name:
            for key in new_keys:
                myindex += 1
                remove_song_name = new_keys[myindex]
                if remove_song_name.count(compare_song_name)>0:
                    if remove_song_name in songs:
                        songs.pop(remove_song_name)
                        keys.remove(remove_song_name)
                if myindex >= len(keys):
                    index += 1
                    break



        #for item in song_dict.
    print(songs)
    return songs
    #print(values)

handle_duplicate(song_dict)

# 原始字典



#print(sort_dict_val(song_dict))